In [51]:
import netCDF4
import pandas as pd
import xarray as xr
pr = xr.open_dataset('../../Colorado-Wildfire-Analysis-and-Prediction/data/new_raw_data/precip.mon.mean.nc')
temp = xr.open_dataset('../../Colorado-Wildfire-Analysis-and-Prediction/data/new_raw_data/air.mon.anom.1981-2010.nc')
# data = pd.read_csv("../../Colorado-Wildfire-Analysis-and-Prediction/data/new_raw_data/fires.csv")
# nc = netCDF4.Dataset("../../Colorado-Wildfire-Analysis-and-Prediction/data/new_raw_data/air.mon.anom.1981-2010.nc", mode='r')
temp.air.to_dataframe().to_csv('temp.csv')
pr.precip.to_dataframe().to_csv('precip.csv')
print(pr)

C:\Users\aweso\anaconda3\lib\site-packages\xarray\coding\times.py:526: SerializationWarning: Unable to decode time axis into full numpy.datetime64 objects, continuing using cftime.datetime objects instead, reason: dates out of range
  dtype = _decode_cf_datetime_dtype(data, units, calendar, self.use_cftime)
C:\Users\aweso\anaconda3\lib\site-packages\numpy\core\_asarray.py:85: SerializationWarning: Unable to decode time axis into full numpy.datetime64 objects, continuing using cftime.datetime objects instead, reason: dates out of range
  return array(a, dtype, copy=False, order=order)

<xarray.Dataset>
Dimensions:  (lat: 72, lon: 144, time: 514)
Coordinates:
  * lat      (lat) float32 88.75 86.25 83.75 81.25 ... -83.75 -86.25 -88.75
  * lon      (lon) float32 1.25 3.75 6.25 8.75 11.25 ... 351.2 353.8 356.2 358.8
  * time     (time) datetime64[ns] 1979-01-01 1979-02-01 ... 2021-10-01
Data variables:
    precip   (time, lat, lon) float32 ...
Attributes:
    Conventions:    COARDS
    title:          CPC Merged Analysis of Precipitation (includes NCEP Reana...
    platform:       Analyses
    source:         ftp ftp.cpc.ncep.noaa.gov precip/cmap/monthly
    dataset_title:  CPC Merged Analysis of Precipitation
    documentation:  https://www.esrl.noaa.gov/psd/data/gridded/data.cmap.html
    date_modified:  26 Feb 2019
    References:     https://www.psl.noaa.gov/data/gridded/data.cmap.html
    version:        V2111
    history:        update 11/2021 V2111
    data_modified:  2021-11-09

In [43]:
data = pd.read_csv('temp.csv')
data_precip = pd.read_csv('precip.csv')
data = data.dropna()
data_precip = data_precip.dropna()
print(data.head(5))
print(data_precip.head(5))
# print(nc)
# precip.to_pandas().to_csv('clim.csv')

                    time   lat    lon       air
210  0001-01-01 00:00:00 -77.5  332.5  0.311546
218  0001-01-01 00:00:00 -72.5   12.5  0.074957
249  0001-01-01 00:00:00 -72.5  167.5  0.036657
250  0001-01-01 00:00:00 -72.5  172.5 -0.001475
251  0001-01-01 00:00:00 -72.5  177.5  0.043985
         time    lat    lon  precip
0  1979-01-01  88.75   1.25    0.21
1  1979-01-01  88.75   3.75    0.21
2  1979-01-01  88.75   6.25    0.21
3  1979-01-01  88.75   8.75    0.20
4  1979-01-01  88.75  11.25    0.20

In [44]:
data = data.drop(data[data['lat'] <= 37].index)
data = data.drop(data[data['lat'] >= 41].index)
data = data.drop(data[data['lon'] <= 251].index)
data = data.drop(data[data['lon'] >= 258].index)


# data.head(15)
# print(data['lat'].max())
# print(data['lat'].min())

# print(data['lon'].min())
# print(data['lon'].max())

# # a pandas.Series designed for time series of a 2D lat,lon grid
# precip_ts = pd.Series(precip, index=dtime) 
data.shape
# precip_ts.to_csv('precip.csv',index=True, header=True)
# 37 N 41 N 102 3 min west, 109 3 min west

(24, 4)

In [49]:
data_precip = data_precip.drop(data_precip[data_precip['lat'] < 37].index)
data_precip = data_precip.drop(data_precip[data_precip['lat'] > 41].index)
data_precip = data_precip.drop(data_precip[data_precip['lon'] < 102].index)
data_precip = data_precip.drop(data_precip[data_precip['lon'] > 109].index)
data_precip.head(10)
# print(data_precip['time'].max())
# data_precip.shape

             time    lat     lon  precip
2921   1979-01-01  38.75  103.75    0.03
2922   1979-01-01  38.75  106.25    0.01
2923   1979-01-01  38.75  108.75    0.00
13289  1979-02-01  38.75  103.75    0.02
13290  1979-02-01  38.75  106.25    0.07
13291  1979-02-01  38.75  108.75    0.26
23657  1979-03-01  38.75  103.75    0.14
23658  1979-03-01  38.75  106.25    0.18
23659  1979-03-01  38.75  108.75    0.29
34025  1979-04-01  38.75  103.75    0.18

In [19]:
print(data['lat'].unique())
print(data['lon'].unique())
print(data_precip['lat'].unique())
print(data_precip['lon'].unique())

[37.5]
[102.5 107.5]
[38.75]
[103.75 106.25 108.75]

In [21]:
data.shape

(24, 4)

In [22]:
data_precip.shape

(1542, 4)

In [45]:
cole_data = pd.read_csv('../../Colorado-Wildfire-Analysis-and-Prediction/data/Clean Data/weather/weatherAvg_CLEANED.csv')
cole_data.shape

(4017, 5)

In [46]:
cole_data.head()

         Dates   Max Temp   Min Temp      Pcpn      Snow
0  01-Jan-2009  43.111111  17.625000  0.000000  0.000000
1  02-Jan-2009  49.444444  20.000000  0.005000  0.150000
2  03-Jan-2009  48.888889  18.000000  0.065556  0.922222
3  04-Jan-2009  31.666667   4.666667  0.015000  0.650000
4  05-Jan-2009  25.222222   1.111111  0.021250  0.288889

In [47]:
cole_data["Dates"].unique()

array(['01-Jan-2009', '02-Jan-2009', '03-Jan-2009', ..., '29-Dec-2019',
       '30-Dec-2019', '31-Dec-2019'], dtype=object)

In [50]:
newest = xr.open_dataset('../../Colorado-Wildfire-Analysis-and-Prediction/data/new_raw_data/agg_terraclimate_windspeed_1979_2020.nc')
#newest.air.to_dataframe().to_csv('temp.csv')
print(newest)

<xarray.Dataset>
Dimensions:  (time: 504, lat: 97, lon: 169)
Coordinates:
  * time     (time) datetime64[ns] 1979-01-01 1979-02-01 ... 2020-12-01
  * lat      (lat) float64 40.98 40.94 40.9 40.85 ... 37.1 37.06 37.02 36.98
  * lon      (lon) float64 -109.0 -109.0 -108.9 -108.9 ... -102.1 -102.1 -102.0
Data variables:
    ws       (time, lat, lon) float32 ...
Attributes: (12/50)
    method:                          These layers from TerraClimate were crea...
    title:                           TerraClimate: monthly climate and climat...
    summary:                         This archive contains a dataset of high-...
    keywords:                        WORLDCLIM,global,monthly, temperature,pr...
    id:                              Blank
    naming_authority:                edu.uidaho.nkn
    ...                              ...
    geospatial_vertical_positive:    Up
    references:                      Abatzoglou, J.T., S.Z. Dobrowski, S.A. P...
    source:                          WorldClim v2.0 (2.5m), CRU Ts4.0, JRA-55
    version:                         v1.0
    Conventions:                     CF-1.6
    History:                         Translated to CF-1.0 Conventions by Netc...

In [52]:
newest.ws.to_dataframe().to_csv('new.csv')

In [77]:
data_new = pd.read_csv('new.csv')
data_new.head(5)

         time        lat         lon    ws
0  1979-01-01  40.979167 -109.020833  2.86
1  1979-01-01  40.979167 -108.979167  2.84
2  1979-01-01  40.979167 -108.937500  2.91
3  1979-01-01  40.979167 -108.895833  2.68
4  1979-01-01  40.979167 -108.854167  2.56

In [97]:
newestest = xr.open_dataset('../../Colorado-Wildfire-Analysis-and-Prediction/data/new_raw_data/Drought_PDSI_1979_2020_GLOBE.nc')
print(newestest)

<xarray.Dataset>
Dimensions:  (time: 504, lat: 241, lon: 169)
Coordinates:
  * time     (time) datetime64[ns] 1979-01-01 1979-02-01 ... 2020-12-01
  * lat      (lat) float64 36.98 36.94 36.9 36.85 ... 27.1 27.06 27.02 26.98
  * lon      (lon) float64 -109.0 -109.0 -108.9 -108.9 ... -102.1 -102.1 -102.0
Data variables:
    PDSI     (time, lat, lon) float32 ...
Attributes: (12/50)
    method:                          These layers from TerraClimate were crea...
    title:                           TerraClimate: monthly climate and climat...
    summary:                         This archive contains a dataset of high-...
    keywords:                        WORLDCLIM,global,monthly, temperature,pr...
    id:                              Blank
    naming_authority:                edu.uidaho.nkn
    ...                              ...
    geospatial_vertical_positive:    Up
    references:                      Abatzoglou, J.T., S.Z. Dobrowski, S.A. P...
    source:                          WorldClim v2.0 (2.5m), CRU Ts4.0, JRA-55
    version:                         v1.0
    Conventions:                     CF-1.6
    History:                         Translated to CF-1.0 Conventions by Netc...

In [98]:
newestest.PDSI.to_dataframe().to_csv('newestset.csv')

In [58]:
data_newestest = pd.read_csv('newestset.csv')
data_newestest.head(5)

         time        lat         lon  PDSI
0  1979-01-01  36.979167 -109.020833  4.18
1  1979-01-01  36.979167 -108.979167  4.15
2  1979-01-01  36.979167 -108.937500  4.11
3  1979-01-01  36.979167 -108.895833  4.10
4  1979-01-01  36.979167 -108.854167  3.94

In [59]:
print(data_new.shape)
print(data_newestest.shape)

(8262072, 4)
(20527416, 4)

In [61]:
print(data_newestest['time'].max())

2020-12-01

In [62]:
print(data_new['time'].max())

2020-12-01

In [65]:
result = data_new.append(data_newestest, ignore_index = False)

In [66]:
result.head()

         time        lat         lon    ws  PDSI
0  1979-01-01  40.979167 -109.020833  2.86   NaN
1  1979-01-01  40.979167 -108.979167  2.84   NaN
2  1979-01-01  40.979167 -108.937500  2.91   NaN
3  1979-01-01  40.979167 -108.895833  2.68   NaN
4  1979-01-01  40.979167 -108.854167  2.56   NaN

In [67]:
result.shape

(28789488, 5)

In [70]:
result = result.dropna()
result.shape

(0, 5)

In [69]:
result.head()

         time        lat         lon    ws  PDSI
0  1979-01-01  40.979167 -109.020833  2.86   NaN
1  1979-01-01  40.979167 -108.979167  2.84   NaN
2  1979-01-01  40.979167 -108.937500  2.91   NaN
3  1979-01-01  40.979167 -108.895833  2.68   NaN
4  1979-01-01  40.979167 -108.854167  2.56   NaN

In [100]:
data_new = pd.read_csv('new.csv')
# data_new = data_new[data_new['lat'] == 37.395833]
# data_new = data_new[data_new['lon'] == -108.979167]

In [87]:
print(data_new)

Empty DataFrame
Columns: [time, lat, lon, ws]
Index: []

In [89]:
import numpy as np

In [101]:
data_new = np.round(data_new, decimals=2)
data_new.head()

         time    lat     lon    ws
0  1979-01-01  40.98 -109.02  2.86
1  1979-01-01  40.98 -108.98  2.84
2  1979-01-01  40.98 -108.94  2.91
3  1979-01-01  40.98 -108.90  2.68
4  1979-01-01  40.98 -108.85  2.56

In [96]:
data_new = data_new[data_new['lat'] == 40.98]
data_new.head()

         time    lat     lon    ws
0  1979-01-01  40.98 -109.02  2.86
1  1979-01-01  40.98 -108.98  2.84
2  1979-01-01  40.98 -108.94  2.91
3  1979-01-01  40.98 -108.90  2.68
4  1979-01-01  40.98 -108.85  2.56

In [99]:
data_newestest = pd.read_csv('newestset.csv')
data_newestest = np.round(data_newestest, decimals=2)

In [102]:
result = data_new.append(data_newestest, ignore_index = False)

In [103]:
result.head()

         time    lat     lon    ws  PDSI
0  1979-01-01  40.98 -109.02  2.86   NaN
1  1979-01-01  40.98 -108.98  2.84   NaN
2  1979-01-01  40.98 -108.94  2.91   NaN
3  1979-01-01  40.98 -108.90  2.68   NaN
4  1979-01-01  40.98 -108.85  2.56   NaN

In [104]:
result.shape

(28789488, 5)

In [105]:
result = result.dropna()

In [106]:
result.shape

(0, 5)